
#######################################################################################

#######################################################################################



mess_hello_str: str = """Привет! Я ваш помощник по расписанию ТУСУР. 🎓
С помощью меня вы можете легко получить актуальную информацию о занятиях.
"""

mess_reg: str = ("Добро пожаловать! Для использования нашего расписания необходимо пройти регистрацию. "
            "Начнем прямо сейчас!"
                 "\n\\/ \\/ \\/ \\/ \\/ \\/ \\/ \\/ \\/ \\/ \\/ \\/ \\/ \\/ \\/ \\/ \\/ \\/ \\/ ")

all_faculty: list[list[list[str]]] = [
    [['Аспирантура', 'aspirantura'], ['РТФ', 'rtf']],
    [['РКФ', 'rkf'], ['ФВС', 'fvs']],
    [['ФСУ', 'fsu'], ['ФЭТ', 'fet']],
    [['ФИТ', 'fit'], ['ЭФ', 'ef']],
    [['ГФ', 'gf'], ['ЮФ', 'yuf']],
    [['ФБ', 'fb'], ['ЗИВФ', 'zivf']],
    [['ФДО', 'fdo'], ['ПИШ', 'pish']]
]

is_user_reg_now: list[str] = []

is_user_get_pars: list[str] = []

